tap "homebrew/cask"
tap "homebrew/cask-fonts"

brew "autoconf"
brew "bash"
brew "bat"
brew "cmake"
brew "coreutils"
brew "direnv"
brew "docker-completion"
brew "docker-compose-completion"
brew "envchain"
brew "exa"
brew "fd"
brew "findutils"
brew "fzf"
brew "gh"
brew "ghq"
brew "git"
brew "git-lfs"
brew "gnu-sed"
brew "gnupg"
brew "grep"
brew "hexyl"
brew "jq"
brew "lazygit"
brew "neovim"
brew "pinentry-mac"
brew "ripgrep"
brew "shellcheck"
brew "sqlite"
brew "tmux"
brew "trash"
brew "vim"
brew "wget"

cask "alacritty"
cask "alfred"
cask "bitwarden"
cask "docker"
cask "firefox"
cask "font-jetbrains-mono-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "gitkraken"
cask "google-chrome"
cask "google-japanese-ime"
cask "hammerspoon"
cask "karabiner-elements"
cask "rectangle"
cask "sublime-text"
cask "visual-studio-code"
